# 1. PANDAS BASICS

In [1]:
# Pandas is a data manipulation and analysis tool that is built on Numpy.
# Pandas uses a data structure known as DataFrame (think of it as Microsoft excel in Python). 
# DataFrames empower programmers to store and manipulate data in a tabular fashion (rows and columns).
# Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [2]:
import pandas as pd

In [3]:
# Let's define two lists as shown below:

my_list = ['APPL','AMZN','TSLA']
my_list

['APPL', 'AMZN', 'TSLA']

In [4]:
label = ['stock 1', 'stock 2','stock 3']
label

['stock 1', 'stock 2', 'stock 3']

In [5]:
# Let's create a one dimensional Pandas "series" 
# Note that series is formed of data and associated labels 
x_series = pd.Series(my_list,label)

In [6]:
# Let's view the series
x_series

stock 1    APPL
stock 2    AMZN
stock 3    TSLA
dtype: object

In [7]:
# Let's obtain the datatype
type(x_series)

pandas.core.series.Series

In [8]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bc_df = pd.DataFrame({'Bank client ID':['111','222','333','444'],'Client name':['Chanel','Steve','Mitch','Ryan'],'Net worth[$]':[3500,29000,10000,2000],'Years with bank':[3,4,9,5]})
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
2            333       Mitch         10000                9
3            444        Ryan          2000                5

In [9]:
# Let's obtain the data type 
type(bc_df)

pandas.core.frame.DataFrame

In [10]:
# you can only view the first couple of rows using .head()
bc_df.head(2)

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4

In [11]:
# you can only view the last couple of rows using .tail()
bc_df.tail(2)

  Bank client ID Client name  Net worth[$]  Years with bank
2            333       Mitch         10000                9
3            444        Ryan          2000                5

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [12]:
portfolio_df = pd.DataFrame({'Stock':['AMZN','MSFT','MCQG','TSLA'],'Number of Shares':[2,5,1,8],'PPS[$]':[300,150,170,300]})
portfolio_df

  Stock  Number of Shares  PPS[$]
0  AMZN                 2     300
1  MSFT                 5     150
2  MCQG                 1     170
3  TSLA                 8     300

In [13]:
# multiply the rows
totalstock = portfolio_df['PPS[$]'] * portfolio_df['Number of Shares']
# .sum to calculate the column, "PPS[$]"
print("The total value of the portfolio is ${:0,.2f}".format(totalstock.sum()))

The total value of the portfolio is $3,920.00

# 2. PANDAS WITH CSV AND HTML DATA

In [14]:
# In order to access data on Google Drive, you need to mount the drive to access it's content

import os 
os.getcwd()

'c:\\Users\\tim.virga\\Documents\\Projects\\StockPrediction\\Section10-pandas'

In [15]:
import csv 
bankinfo = csv.reader('bank_client_information.csv')

In [16]:
# Pandas is used to read a csv file and store data in a DataFrame
df = pd.read_csv('bank_client_information.csv')
df

  First Name Last Name              Email Postal Code  Net Worth
0     Joseph    Patton     daafeja@boh.jm     M6U 5U7  $2,629.13
1       Noah     Moran  guutodi@bigwoc.kw     K2D 4M9  $8,626.96
2       Nina    Keller    azikez@gahew.mr     S1T 4E6  $9,072.02

In [17]:
# write to a csv file without an index
df.to_csv('example_output.csv', index = False)

In [18]:
# write to a csv file with an index
df.to_csv('example_output.csv', index = True)

In [19]:
# Read tabular data using read_html
housePriceDF = pd.read_html('http://www.livingin-canada.com/house-prices-canada.html') # you cannot read HTTPS with pd.read_html() method and if you do, require import of SSL moddule
housePriceDF

[                                                City  \
 0                                      Vancouver, BC
 1                                       Toronto, Ont
 2                                        Ottawa, Ont
 3                                       Calgary, Alb
 4                                      Montreal, Que
 5                                        Halifax, NS
 6                                       Regina, Sask
 7                                    Fredericton, NB
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                  Average House Price  \
 0                                         $1,036,000
 1                                           $870,000
 2                                           $479,000
 3                                           $410,000
 4                                           $435,000
 5                                           $331,000
 6                                           $254,000
 7                                           $198,000
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                      12 Month Change
 0                                           + 2.63 %
 1                                            +10.2 %
 2                                           + 15.4 %
 3                                            – 1.5 %
 4                                            + 9.3 %
 5                                            + 3.6 %
 6                                            – 3.9 %
 7                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ,
                                              Province  \
 0                                    British Columbia
 1                                             Ontario
 2                                             Alberta
 3                                              Quebec
 4                                            Manitoba
 5                                        Saskatchewan
 6                                         Nova Scotia
 7                                Prince Edward Island
 8                             Newfoundland / Labrador
 9                                       New Brunswick
 10                                   Canadian Average
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                   Average House Price  \
 0                                            $736,000
 1                                            $594,000
 2                                            $353,000
 3                                            $340,000
 4                                            $295,000
 5                                            $271,000
 6                                            $266,000
 7                                            $243,000
 8                                            $236,000
 9                                            $183,000
 10                                           $488,000
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                       12 Month Change
 0                                             + 7.6 %
 1                                             – 3.2 %
 2                                             – 7.5 %
 3                                             + 7.6 %
 4                                             – 1.4 %
 5                                             – 3.8 %
 6                                             + 3.5 %
 7                                             + 3.0 %
 8                                             – 1.6 %
 9                                             – 2.2 %
 10                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ]

**MINI CHALLENGE #2:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [20]:
us_data = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
us_data

[                                        Year of birth  \
 0                                      1937 and prior
 1                                                1938
 2                                                1939
 3                                                1940
 4                                                1941
 5                                                1942
 6                                             1943-54
 7                                                1955
 8                                                1956
 9                                                1957
 10                                               1958
 11                                               1959
 12                                     1960 and later
 13  Notes: 1. Persons born on January 1 of any yea...

                                                   Age
 0                                                  65
 1                                     65 and 2 months
 2                                     65 and 4 months
 3                                     65 and 6 months
 4                                     65 and 8 months
 5                                    65 and 10 months
 6                                                  66
 7                                     66 and 2 months
 8                                     66 and 4 months
 9                                     66 and 6 months
 10                                    66 and 8 months
 11                                   66 and 10 months
 12                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  ]

# 3. PANDAS OPERATIONS

In [21]:
# Let's define a dataframe as follows:
bc_df = pd.DataFrame({'Bank client ID':['111','222','333','444'],'Client name':['Chanel','Steve','Mitch','Ryan'],'Net worth[$]':[3500,29000,10000,2000],'Years with bank':[3,4,9,5]})
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
2            333       Mitch         10000                9
3            444        Ryan          2000                5

In [22]:
# Pick certain rows that satisfy a certain criteria 

df_loyal = bc_df[(bc_df['Years with bank'] >= 5)]
df_loyal
#for i in bc_df[2]<4000:
#    print(i)

  Bank client ID Client name  Net worth[$]  Years with bank
2            333       Mitch         10000                9
3            444        Ryan          2000                5

In [23]:
# Delete a column from a DataFrame
del bc_df['Bank client ID']
bc_df

  Client name  Net worth[$]  Years with bank
0      Chanel          3500                3
1       Steve         29000                4
2       Mitch         10000                9
3        Ryan          2000                5

**MINI CHALLENGE #3:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [24]:
high_net = bc_df[ ( bc_df['Net worth[$]'] >= 5000) ]
high_net_sum = high_net['Net worth[$]'].sum()
print('The total sum of high net worth clients is ${:0,.2f}'.format(high_net_sum))

The total sum of high net worth clients is $39,000.00

# 4. PANDAS WITH FUNCTIONS

In [25]:
# Let's define a dataframe as follows:
bc_df

  Client name  Net worth[$]  Years with bank
0      Chanel          3500                3
1       Steve         29000                4
2       Mitch         10000                9
3        Ryan          2000                5

In [26]:
# Define a function that increases all clients networth (stocks) by a fixed value of 10% (for simplicity sake) 

def networth_update(balance):
    return balance * 1.1

In [27]:
# You can apply a function to the DataFrame 
bc_df['Net worth[$]'].apply(networth_update)

0     3850.0
1    31900.0
2    11000.0
3     2200.0
Name: Net worth[$], dtype: float64

In [28]:
bc_df['Years with bank'].sum()

21

**MINI CHALLENGE #4:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [29]:
def price_double(stocks):
    stocks * 2 and + 100
    return stocks.sum()

In [30]:
def price_double(stocks):
   return stocks * 2  + 100 # return the passed value then multiply by 2 and add 100

In [31]:
bc_df['Net worth[$]'].apply(price_double) # remember to call the function for a pandas DF we use .apply()

0     7100
1    58100
2    20100
3     4100
Name: Net worth[$], dtype: int64

# 5. SORTING AND ORDERING

In [32]:
# Let's define a dataframe as follows:
bc_df = pd.DataFrame({'Bank client ID':['111','222','333','444'],'Client name':['Chanel','Steve','Mitch','Ryan'],'Net worth[$]':[3500,29000,10000,2000],'Years with bank':[3,4,9,5]})
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
2            333       Mitch         10000                9
3            444        Ryan          2000                5

In [33]:
# You can sort the values in the dataframe according to number of years with bank
bc_df.sort_values(by = 'Years with bank')

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
3            444        Ryan          2000                5
2            333       Mitch         10000                9

In [34]:
# Note that nothing changed in memory! you have to make sure that inplace is set to True
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
2            333       Mitch         10000                9
3            444        Ryan          2000                5

In [35]:
# Set inplace = True to ensure that change has taken place in memory 
bc_df.sort_values(by = 'Years with bank', inplace=True) # inplace=True will store the sort in memory

In [36]:
# Note that now the change (ordering) took place 
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
0            111      Chanel          3500                3
1            222       Steve         29000                4
3            444        Ryan          2000                5
2            333       Mitch         10000                9

**MINI CHALLENGE #5:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [37]:
bc_df.sort_values(by='Net worth[$]', inplace=True)
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
3            444        Ryan          2000                5
0            111      Chanel          3500                3
2            333       Mitch         10000                9
1            222       Steve         29000                4

In [38]:
bc_df

  Bank client ID Client name  Net worth[$]  Years with bank
3            444        Ryan          2000                5
0            111      Chanel          3500                3
2            333       Mitch         10000                9
1            222       Steve         29000                4

# 6. CONCATENATING AND MERGING WITH PANDAS

Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [48]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [49]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [50]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [52]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [39]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5

In [61]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {
    'Bank Client ID':['1','2','3','4','5'],
    'First name':['Tim', 'Frank','Steve','John','David'],
    'Last name':['Michaels', 'Smith', 'Albertostein', 'Carter', 'Miller']
    }
raw_data

{'Bank Client ID': ['1', '2', '3', '4', '5'],
 'First name': ['Tim', 'Frank', 'Steve', 'John', 'David'],
 'Last name': ['Michaels', 'Smith', 'Albertostein', 'Carter', 'Miller']}

In [62]:
bank_df = pd.DataFrame(raw_data, columns=['Bank client ID', 'First Name', 'Last Name'])
bank_df

Empty DataFrame
Columns: [Bank client ID, First Name, Last Name]
Index: []

In [58]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10

In [42]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10

In [43]:
# Let's merge all data on 'Bank Client ID'

**MINI CHALLENGE #6:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

# EXCELLENT JOB!

# MINI CHALLENGE SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [44]:
portfolio_df = pd.DataFrame({'stock ticker symbols':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40], 
                             'Number of stocks':[3, 4, 9]})
portfolio_df

  stock ticker symbols  price per share [$]  Number of stocks
0                 AAPL                 3500                 3
1                 AMZN                  200                 4
2                    T                   40                 9

In [45]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
print(stocks_dollar_value)
print('Total portfolio value = {}'.format(stocks_dollar_value.sum()))

0    10500
1      800
2      360
dtype: int64
Total portfolio value = 11660

**MINI CHALLENGE #2 SOLUTION:**
- **Write a code that uses Pandas to read tabular US retirement data**
- **You can use data from here: https://www.ssa.gov/oact/progdata/nra.html**

In [46]:
# Read tabular data using read_html
retirement_age_df = pd.read_html('https://www.ssa.gov/oact/progdata/nra.html')
retirement_age_df

[                                        Year of birth  \
 0                                      1937 and prior
 1                                                1938
 2                                                1939
 3                                                1940
 4                                                1941
 5                                                1942
 6                                             1943-54
 7                                                1955
 8                                                1956
 9                                                1957
 10                                               1958
 11                                               1959
 12                                     1960 and later
 13  Notes: 1. Persons born on January 1 of any yea...

                                                   Age
 0                                                  65
 1                                     65 and 2 months
 2                                     65 and 4 months
 3                                     65 and 6 months
 4                                     65 and 8 months
 5                                    65 and 10 months
 6                                                  66
 7                                     66 and 2 months
 8                                     66 and 4 months
 9                                     66 and 6 months
 10                                    66 and 8 months
 11                                   66 and 10 months
 12                                                 67
 13  Notes: 1. Persons born on January 1 of any yea...  ]

**MINI CHALLENGE #3 SOLUTION:**
- **Using "bank_client_df" DataFrame, leverage pandas operations to only select high networth individuals with minimum $5000** 
- **What is the combined networth for all customers with 5000+ networth?**

In [47]:
df_high_networth = bank_client_df[ (bank_client_df['Net worth [$]'] >= 5000) ]
df_high_networth

NameError: name 'bank_client_df' is not defined

In [ ]:
df_high_networth['Net worth [$]'].sum()

**MINI CHALLENGE #4 SOLUTION:**
- **Define a function that doubles stock prices and adds $100**
- **Apply the function to the DataFrame**
- **Calculate the updated total networth of all clients combined**

In [ ]:
def networth_update(balance):
    return balance * 2 + 100 # assume that stock prices increased by 10%

In [ ]:
# You can apply a function to the DataFrame 
results = bank_client_df['Net worth [$]'].apply(networth_update)
results

In [ ]:
results.sum()

**MINI CHALLENGE #5 SOLUTION:**
- **Sort customers by networth instead of years with bank. Make sure to update values in-memory.**

In [ ]:
# You can sort the values in the dataframe according to number of years with bank
bank_client_df.sort_values(by = 'Net worth [$]', inplace = True) 
bank_client_df

**MINI CHALLENGE #6 SOLUTION:**
- **Let's assume that you became a new client to the bank**
- **Define a new DataFrame that contains your information such as client ID (choose 11), first name, last name, and annual salary.**
- **Add this new dataframe to the original dataframe "bank_df_all".**

In [ ]:
new_client = {
        'Bank Client ID': ['11'],
        'First Name': ['Ry'], 
        'Last Name': ['Aly'],
        'Annual Salary [$/year]' : [1000]}
new_client_df = pd.DataFrame(new_client, columns = ['Bank Client ID', 'First Name', 'Last Name', 'Annual Salary [$/year]'])
new_client_df

In [ ]:
new_df = pd.concat([bank_df_all, new_client_df], axis = 0)
new_df